Revit 2027 API
AssemblyInstance.IsMember Method
 Determines whether the given ElementId is a member of this assembly
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMember(
	ElementId id
)
Public Function IsMember (
	id As ElementId
) As Boolean
public:
bool IsMember(
	ElementId^ id
)
member IsMember :
        id : ElementId -> bool
Parameters
id ElementId
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace